app/controllers/cards_controller.rb

  def index
    render json: Card.all
---
SELECT "cards".* FROM "cards"

  def create
    respond_with current_user.cards.create(card_params)
---
INSERT INTO "cards" ("title", "situation", "task", "action", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "dasf"], ["situation", "fdasf"], ["task", "fdsaf"], ["action", "create"], ["created_at", 2016-12-07 17:37:12 UTC], ["updated_at", 2016-12-07 17:37:12 UTC], ["user_id", 1]]